export default `
<div class="meta">
  <span class="tag">Python</span>
  <span>2026-05-13 创建</span>
</div>

# Python: 优雅且简洁的语言

<div class="toc">
  <h3>目录</h3>
  <ul>
    <li><a href="#1-个人见解">1. 个人见解</a></li>
    <li>
      <details>
        <summary><a href="#2-数据类型">2. 数据类型</a></summary>
        <ul class="toc-l2">
          <li><a href="#21-数据类型与转换">2.1 数据类型与转换</a></li>
          <li><a href="#22-数值与字符串">2.2 数值与字符串</a></li>
          <li><a href="#23-容器类型">2.3 容器类型</a></li>
        </ul>
      </details>
    </li>
    <li>
      <details>
        <summary><a href="#3-基础语法">3. 基础语法</a></summary>
        <ul class="toc-l2">
          <li><a href="#31-语法基础">3.1 语法基础</a></li>
          <li><a href="#32-运算符与表达式">3.2 运算符与表达式</a></li>
          <li><a href="#33-流程控制">3.3 流程控制</a></li>
          <li><a href="#34-推导式">3.4 推导式</a></li>
        </ul>
      </details>
    </li>
    <li>
      <details>
        <summary><a href="#4-函数与进阶">4. 函数与进阶</a></summary>
        <ul class="toc-l2">
          <li><a href="#41-函数编程">4.1 函数编程</a></li>
          <li><a href="#42-迭代器与生成器">4.2 迭代器与生成器</a></li>
          <li><a href="#43-面向对象">4.3 面向对象</a></li>
          <li><a href="#44-类型注解">4.4 类型注解</a></li>
        </ul>
      </details>
    </li>
  </ul>
</div>

## 1. 个人见解

Python 是一门接近自然语言的编程，初学者是十分适合从它学起的。
那么除了简单易学，它还有什么优点？最显而易见的就是代码量少了，通常会比Java，CPP等语言要更短，使开发效率大大提高。
令Ivy最喜欢但也最头疼的是，它拥有庞大的标准库和第三方库，无论你在数据分析，人工智能，爬虫，又或者是Web开发，这些领域都有成熟的方案提供给你，方便是必然的，头疼的原因就是太多太多，经常记不住或是搞混淆，不过现在不用太担心，因为常用的也就那么几个。
这里，python代码之所以能够简洁的最大功臣就是动态类型——变量无需声明类型，但一定要小心报错风险，不过你应该知道，debug也是学习python的一种方法。
并且python拥有很好的生态，开源资源很丰富，很容易解决遇到的问题。BUT！一定要注意，python是解释性语言，执行速度相对较慢，并不适合CPU密集型并行计算！

## 2. 数据类型

### 2.1 数据类型与转换

### 2.2 数值与字符串

### 2.3 容器类型

## 3. 基础语法

### 3.1 语法基础

### 3.2 运算符与表达式

### 3.3 流程控制

### 3.4 推导式

## 4. 函数与进阶

### 4.1 函数编程

### 4.2 迭代器与生成器

### 4.3 面向对象

### 4.4 类型注解

<div class="evolution-section">
.
</div>
`;
